export const FERTILIZERS = [
  new Category('Макроелементи', true, ['Азот', 'Фосфор', 'Калій', 'Магній', 'Залізо', 'Сірка']),
  new Category('Мікроелементи', true, ['Бор', 'Марганець', 'Мідь', 'Молібден', 'Цинк', 'Хлор']),
  new Category('Органічні добрива', true, [
    'Гній',
    'Гнойова жижа',
    'Пташиний послід',
    'Торф та компости',
    'Сидеральні добрива',
    'Біогумус (вермікомпост)',
  ]),
  new Category('Мінеральні добрива', true, ['Азотні', 'Фосфорні', 'Калійні', 'Комплексні добрива']),
];
