export const PESTS_AND_DISEASES = [
  new Category('Хвороби ягідників', true, ['Хвороби полуниці', 'Хвороби смородини і агрусу', 'Хвороби малини']),
  new Category('Шкідники ягідників', true, ['Шкідники полуниці', 'Шкідники смородини і агрусу', 'Шкідники малини']),
  new Category('Хвороби овочів', true, [
    'Хвороби капусти',
    'Хвороби цибулі і часнику',
    'Хвороби гарбузових',
    'Хвороби картоплі',
  ]),
  new Category('Шкідники овочів', true, [
    'Шкідники капусти',
    'Шкідники цибулі і часнику',
    'Шкідники гарбузових',
    'Шкідники картоплі',
  ]),
];
