import type { CategoryTemplateCollection } from '~/utils/types/CategoryTypes';

export const DOBRYVA_TEMPLATE: CategoryTemplateCollection = [
  ['Макроелементи', ['Азот', 'Фосфор', 'Калій', 'Магній', 'Залізо', 'Сірка']],
  ['Мікроелементи', ['Бор', 'Марганець', 'Мідь', 'Молібден', 'Цинк', 'Хлор']],
  [
    'Органічні добрива',
    ['Гній', 'Гнойова жижа', 'Пташиний послід', 'Торф та компости', 'Сидеральні добрива', 'Біогумус (вермікомпост'],
  ],
  ['Мінеральні добрива', ['Азотні', 'Фосфорні', 'Калійні', 'Комплексні добрива']],
];
