import type { CategoryTemplateCollection } from '~/utils/types/CategoryTypes';

/**
 * Список категорій овочів.
 *
 * */
export const OVOCHI_TEMPLATE: CategoryTemplateCollection = [
  [
    'Капустяні',
    [
      'Капуста білокачанна',
      'Капуста червонокачанна',
      'Капуста савойська',
      'Капуста брюссельська',
      'Капуста цвітна',
      'Капуста кольрабі',
      'Капуста броколі',
    ],
  ],
  ['Бобові', ['Горох', 'Квасоля']],
  ['Бульбоплоди', ['Картопля', 'Топінамбур']],
  [
    'Коренеплоди',
    ['Морква', 'Буряк', 'Редиска', 'Редька', 'Петрушка', 'Селера', 'Пастернак', 'Хрін', 'Ріпа', 'Бруква', 'Мангольд'],
  ],
  [
    'Цибулеві',
    [
      'Цибуля ріпчаста',
      'Цибуля-батун',
      'Цибуля зелена',
      'Цибуля-слизун',
      'Цибуля-шалот',
      'Цибуля-батун',
      'Цибуля-чорнушка',
      'Часник',
    ],
  ],
  ['Пасльонові', ['Томати', 'Баклажани', 'Перець', 'Кімнатний перець']],
  ['Пряно-смакові рослини', ['Кріп', 'Кмин', "М'ята перцева", 'Майоран', 'Базилік', 'Естрагон', 'Імбир']],
  ['Гарбузові', ['Огірки', 'Кабачки, патисони', 'Посадка кабачків', 'Гарбуз']],
  ['Салатні', ['Салат', 'Салат-латук', 'Крес-салат', 'Щавель', 'Шпінат', 'Ревінь', 'Рукола']],
  [
    'Ягідні рослини',
    [
      'Полуниця',
      'Полуниця ремонтантна',
      'Кучерява полуниця',
      'Полуниця із насіння',
      'Малина',
      'Малина із насіння',
      'Аґрус',
      'Смородина',
    ],
  ],
  [
    'Вирощування розсади',
    [
      'Розсада капусти',
      'Розсада томатів',
      'Розсада баклажанів',
      'Розсада перцю',
      'Розсада огірків, кабачків, гарбуза',
      'Розсада селери',
      'Розсада цибулі',
    ],
  ],
];
